In [2]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [11]:
file_path = r"C:\Users\user\Documents\Data scrolls\DataSet\Task 14 Sales Data.xlsx - Sales Data.csv"

# Load the data set
sales_df = pd.read_csv(file_path, parse_dates=['Order Date'])
sales_df.head()
# sales_df.info()

C:\Users\user\AppData\Local\Temp\ipykernel_6560\1101228800.py:4: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  sales_df = pd.read_csv(file_path, parse_dates=['Order Date'])

,Unnamed: 0,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Month,Month.1,Sales,City,Hour
0,0,141234,iPhone,1,700.00,2019-01-22 21:25:00,"944 Walnut St, Boston, MA 02215",1,January,700.00,Boston,21
1,1,141235,Lightning Charging Cable,1,14.95,2019-01-28 14:15:00,"185 Maple St, Portland, OR 97035",1,January,14.95,Portland,14
2,2,141236,Wired Headphones,2,11.99,2019-01-17 13:33:00,"538 Adams St, San Francisco, CA 94016",1,January,23.98,San Francisco,13
3,3,141237,27in FHD Monitor,1,149.99,2019-01-05 20:33:00,"738 10th St, Los Angeles, CA 90001",1,January,149.99,Los Angeles,20
4,4,141238,Wired Headphones,1,11.99,2019-01-25 11:59:00,"387 10th St, Austin, TX 73301",1,January,11.99,Austin,11

In [44]:
sales_df.drop('Month', axis=1)
month_order = ['January', 'February', 'March', 'April','May','June','July','August','September', 'October', 'November', 'December']
sales_df['Month.1'] = pd.Categorical(sales_df['Month.1'], categories=month_order, ordered=True)
month_sales = sales_df.groupby('Month.1')['Sales'].sum().sort_values(ascending=False)
month_sales.columns = ['Month', 'Total_sales']
month_sales = month_sales.reset_index()

month_sales

C:\Users\user\AppData\Local\Temp\ipykernel_6560\63886059.py:4: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  month_sales = sales_df.groupby('Month.1')['Sales'].sum().sort_values(ascending=False)

      Month.1       Sales
0    December  4613443.34
1     October  3736726.88
2       April  3390670.24
3    November  3199603.20
4         May  3152606.75
5       March  2807100.38
6        July  2647775.76
7        June  2577802.26
8      August  2244467.88
9    February  2202022.42
10  September  2097560.13
11    January  1822256.73

In [50]:
# Group by cities and calculate top sales by cities
city_sales = sales_df.groupby('City')['Sales'].sum().sort_values(ascending=False)
city_sales.reset_index()
city_sales.index[0]

' San Francisco'